{
  "pages": {
    "about": {
      "title": "About me",
      "tech_knowledge": {
        "title": "Tech knowledge"
      },
      "show_all": "Show all"
    },
    "projects": {
      "title": "Github projects"
    },
    "blog": {
      "title": "Blog posts"
    },
    "career": {
      "title": "Career",
      "description_1": "Hello there 👋",
      "description_2": "I'm glad you're interested to know more about me and my career, here you'll see a preview of my career as a Software Engineer and the jouney I walked through, if you wanna know more about me, please don't hesitate to contact me or look into my linkedin for more details and full description of my jobs.",
      "jobs": [
        {
          "id": "prosus",
          "period": "Aug 2025 - present",
          "company": "Prosus",
          "title": "Senior Software Engineer",
          "description": "Full-stack engineer at Prosus, developing AI-driven products like iFood's Concierge AI, a conversational food-ordering assistant, and Toqan, an automation-focused AI chat integrating tools for web search, file handling, and messaging. Built scalable, modern frontends with React, TypeScript, Zustand, and WebSockets."
        },
        {
          "id": "personio",
          "period": "Sep 2023 - Jul 2025 (1y10m)",
          "company": "Personio",
          "title": "Senior Frontend Engineer",
          "description": "I've implemented high-quality features that significantly impact both scale and product performance. Additionally, I monitor and enhance our Service Level Objectives (SLOs) and Datadog Synthetic tests to ensure the reliability and observability of our product."
        },
        {
          "id": "dash",
          "period": "Sep 2021 - Aug 2023 (2y)",
          "company": "DASH",
          "title": "Team Lead / Senior Frontend Engineer",
          "description": "I've worked on candidate mobile app and candidate web apps, leading projects, multi functional team, best practices and much more"
        },
        {
          "id": "adyen",
          "period": "Sep 2020 - Aug 2021 (1y)",
          "company": "Adyen",
          "title": "Senior Frontend Engineer",
          "description": "I've worked on KYC (Know Your Customer) project, a large web app that onboards millions of customer every year"
        },
        {
          "id": "youngcapital",
          "period": "Sep 2018 - Aug 2020 (2y)",
          "company": "YoungCapital",
          "title": "Senior Frontend Engineer",
          "description": "I've worked on candidate web apps delivering new high quality features to meet the candidates needs"
        },
        {
          "id": "mediamonks",
          "period": "Sep 2017 - Aug 2018 (1y)",
          "company": "MediaMonks",
          "title": "Frontend Engineer",
          "description": "I've worked on Slimming World and Adidas projects, having direct impact in two large web applications, delivering new features with quality and speed"
        },
        {
          "id": "labtrans",
          "period": "Jan 2013 - Aug 2017 (4y8m)",
          "company": "LabTrans",
          "title": "Senior Software Engineer",
          "description": "I've worked on multiple projects related to transport in Brazil, delivering metrics and statistics to help executive teams to make decisions"
        },
        {
          "id": "tdsa",
          "period": "Aug 2009 - Dec 2012 (3y5m)",
          "company": "TDSA Systems",
          "title": "Software Engineer",
          "description": "I've worked on clinic systems, implemented and maintained the systems, helping thousands of clinics to manage their businesses"
        }
      ]
    },
    "load_more": "Load more"
  },
  "content": {
    "title": "Senior Software Engineer",
    "description": "Hi, I’m Gus! I’ve been working in web development for quite some time now. I hold degrees in Information Systems and Technical Programming, and I’m genuinely passionate about what I do. Over the years, I’ve developed a solid foundation working with databases, backend services, frontend technologies, and mobile development, which helps me bring a holistic approach to engineering challenges. I enjoy working in agile environments, leading teams, and supporting others in achieving their goals and growing professionally. Would you like to know more about me? Check it out my {link1} and {link2}.",
    "english": "English",
    "portuguese": "Portuguese"
  },
  "hashtags": {
    "about": "About me",
    "projects": "Projects",
    "blog": "Blog",
    "career": "Career"
  }
}
