{
  "pages": {
    "about": {
      "title": "Sobre mim",
      "tech_knowledge": {
        "title": "Conhecimento técnico"
      },
      "show_all": "Mostrar todos"
    },
    "projects": {
      "title": "Projetos do Github"
    },
    "blog": {
      "title": "Artigos"
    },
    "career": {
      "title": "Carreira",
      "description_1": "Olá 👋",
      "description_2": "Fico feliz que você está interessado em saber mais sobre mim e minha carreira, aqui você verá uma prévia da minha carreira como Engenheiro de Software e da jornada que percorri, se quiser saber mais sobre mim, por favor não hesite em entrar em contato comigo ou consulte meu LinkedIn para obter mais detalhes e uma descrição completa dos meus trabalhos.",
      "jobs": [
        {
          "id": "prosus",
          "period": "Ago 2025 - atualmente",
          "company": "Prosus",
          "title": "Senior Software Engineer",
          "description": "Na Prosus, contribuo para produtos AI-driven em todo o portfólio, com foco em experiências centradas no usuário e escaláveis; atualmente, trabalho no Concierge AI do iFood, construindo uma interface de descoberta baseada em React e um agente de IA que interpreta intenções para fornecer recomendações de comida contextuais, integrando-se com APIs do iFood e projetando sistemas de backend escaláveis e em tempo real; minhas responsabilidades abrangem desenvolvimento full-stack, NLP conversacional, colaboração entre equipes e otimização de UX em escala usando Python, TypeScript, React e LLMs"
        },
        {
          "id": "personio",
          "period": "Set 2023 - Jul 2025 (1 ano e 10 meses)",
          "company": "Personio",
          "title": "Senior Frontend Engineer",
          "description": "Tenho implementado recursos de alta qualidade que impactam significativamente tanto a escala quanto o desempenho do produto. Além disso, monitoro e aprimoro nossos Service Level Objectives (SLOs) e Datadog Synthetic Tests para garantir a confiabilidade e a observabilidade do nosso produto."
        },
        {
          "id": "dash",
          "period": "Set 2021 - Ago 2023 (2 anos)",
          "company": "DASH",
          "title": "Team Lead / Senior Frontend Engineer",
          "description": "Trabalhei em aplicativos móveis candidatos e aplicativos web candidatos, liderando projetos, equipe multifuncional, melhores práticas e muito mais"
        },
        {
          "id": "adyen",
          "period": "Set 2020 - Ago 2021 (1 ano)",
          "company": "Adyen",
          "title": "Senior Frontend Engineer",
          "description": "Trabalhei no projeto KYC (Know Your Customer), um grande aplicativo web que integra milhões de clientes todos os anos"
        },
        {
          "id": "youngcapital",
          "period": "Set 2018 - Ago 2020 (2 anos)",
          "company": "YoungCapital",
          "title": "Senior Frontend Engineer",
          "description": "Trabalhei em aplicativos web para candidatos, oferecendo novos recursos de alta qualidade para atender às necessidades dos mesmos"
        },
        {
          "id": "mediamonks",
          "period": "Set 2017 - Ago 2018 (1 ano)",
          "company": "MediaMonks",
          "title": "Frontend Engineer",
          "description": "Trabalhei em projetos como Slimming World e Adidas, impactando diretamente em nessas duas grandes aplicações web, entregando funcionalidade com qualidade e rapidez"
        },
        {
          "id": "labtrans",
          "period": "Jan 2013 - Aug 2017 (4 anos e 8 meses)",
          "company": "LabTrans",
          "title": "Senior Software Engineer",
          "description": "Trabalhei em diversos projetos relacionados ao transporte no Brasil, entregando métricas e estatísticas para ajudar equipes executivas na tomada de decisões"
        },
        {
          "id": "tdsa",
          "period": "Ago 2009 - Dez 2012 (3 anos e 5 meses)",
          "company": "TDSA Sistemas",
          "title": "Software Engineer",
          "description": "Trabalhei em sistemas clínicos, implementei e mantive os sistemas, ajudando milhares de clínicas a gerenciar seus negócios"
        }
      ]
    },
    "load_more": "Mais"
  },
  "content": {
    "title": "Senior Software Engineer",
    "description": "Olá, eu sou o Gus! Trabalho com desenvolvimento web há algum tempo. Sou formado em Sistemas de Informação e Programação Técnica e sou genuinamente apaixonado pelo que faço. Ao longo dos anos, desenvolvi uma base sólida trabalhando com bancos de dados, serviços de back-end, tecnologias de front-end e desenvolvimento mobile, o que me ajuda a adotar uma abordagem holística para os desafios da engenharia. Gosto de trabalhar em ambientes ágeis, liderar equipes e ajudar outras pessoas a atingirem seus objetivos e crescerem profissionalmente. Gostaria de saber mais sobre mim? Confira meus {link1} e {link2}.",
    "english": "Inglês",
    "portuguese": "Português"
  },
  "hashtags": {
    "about": "Sobre mim",
    "projects": "Projetos",
    "blog": "Artigos",
    "career": "Carreira"
  }
}
